Autodesk.Revit.DB.Lighting.CircleLightShape.EmitDiameter
The emit diameter.
The emit diameter as a numerical value in feet between 1.0e-9 and 30000.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
Since:
2013

Autodesk.Revit.DB.Lighting.CircleLightShape.#ctor(Autodesk.Revit.DB.Lighting.CircleLightShape)
Creates a copy of the given circle light shape
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.CircleLightShape.#ctor(System.Double)
Creates a circle light shape object with the given emit diameter.
emitDiameter:
The emit diameter as a numerical value in feet between 1.0e-9 and 30000.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
Since:
2013

Autodesk.Revit.DB.Lighting.CircleLightShape.#ctor
Creates a circle light shape object with 2.0' emit diameter.
Since:
2013

Autodesk.Revit.DB.Lighting.CircleLightShape
This class encapsulates a circle light shape.
Since:
2013